-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 06, 2024 at 05:07 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `data`
--

-- --------------------------------------------------------

--
-- Table structure for table `student`
--

CREATE TABLE `student` (
  `ID` int(11) NOT NULL,
  `First_name` varchar(225) NOT NULL,
  `Last_name` varchar(225) NOT NULL,
  `Student_id` varchar(225) NOT NULL,
  `Student_level` varchar(225) NOT NULL,
  `Class_id` varchar(225) NOT NULL,
  `Email` varchar(225) NOT NULL,
  `User_name` varchar(225) NOT NULL,
  `Password` varchar(225) NOT NULL,
  `Create_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `student`
--

INSERT INTO `student` (`ID`, `First_name`, `Last_name`, `Student_id`, `Student_level`, `Class_id`, `Email`, `User_name`, `Password`, `Create_at`) VALUES
(1, 'กันตภณ', 'จวนอึ้ง', '38595', '2', '13', '38595@bpk.ac.th', '38595@bpk.ac.th', '38595@bpk.ac.th', '2024-08-06 10:03:46'),
(2, 'ธนวิชญ์', 'เลิศศรีบุญเรือง', '38596', '2', '13', '38596@bpk.ac.th', '38596@bpk.ac.th', '38596@bpk.ac.th', '2024-08-06 10:03:46'),
(3, 'จิรายุ', 'ทาวรรณ', '38597', '2', '13', '38597@bpk.ac.th', '38597@bpk.ac.th', '38597@bpk.ac.th', '2024-08-06 10:03:46'),
(4, 'เจษฎากร', 'จันทรางกูล', '38598', '2', '13', '38598@bpk.ac.th', '38598@bpk.ac.th', '38598@bpk.ac.th', '2024-08-06 10:03:46'),
(5, 'ชุติพนธ์', 'เผดิม', '38600', '2', '13', '38600@bpk.ac.th', '38600@bpk.ac.th', '38600@bpk.ac.th', '2024-08-06 10:03:46'),
(6, 'ตรัย', 'คุปตารักษ์', '38601', '2', '13', '38601@bpk.ac.th', '38601@bpk.ac.th', '38601@bpk.ac.th', '2024-08-06 10:03:46'),
(7, 'ธัญยวัชร์', 'พัวประเสริฐสุข', '38602', '2', '13', '38602@bpk.ac.th', '38602@bpk.ac.th', '38602@bpk.ac.th', '2024-08-06 10:03:46'),
(8, 'ธีรพัฒน์', 'โสธร', '38603', '2', '13', '38603@bpk.ac.th', '38603@bpk.ac.th', '38603@bpk.ac.th', '2024-08-06 10:03:46'),
(9, 'พงษ์พิพัฒน์', 'โรจนพุทธิกุล', '38604', '2', '13', '38604@bpk.ac.th', '38604@bpk.ac.th', '38604@bpk.ac.th', '2024-08-06 10:03:46'),
(10, 'พชรกร', 'ศรีธนะรัตน์', '38605', '2', '13', '38605@bpk.ac.th', '38605@bpk.ac.th', '38605@bpk.ac.th', '2024-08-06 10:03:46'),
(11, 'รัชชานนท์', 'อรุณเทววิโรจน์', '38606', '2', '13', '38606@bpk.ac.th', '38606@bpk.ac.th', '38606@bpk.ac.th', '2024-08-06 10:03:46'),
(12, 'วรวัฒน์', 'อัสถิ', '38608', '2', '13', '38608@bpk.ac.th', '38608@bpk.ac.th', '38608@bpk.ac.th', '2024-08-06 10:03:46'),
(13, 'วัชรนันทน์', 'วิทยา', '38609', '2', '13', '38609@bpk.ac.th', '38609@bpk.ac.th', '38609@bpk.ac.th', '2024-08-06 10:03:46'),
(14, 'ศิวกร', 'นาคเงิน', '38610', '2', '13', '38610@bpk.ac.th', '38610@bpk.ac.th', '38610@bpk.ac.th', '2024-08-06 10:03:46'),
(15, 'สรวิชญ์', 'พลศรี', '38611', '2', '13', '38611@bpk.ac.th', '38611@bpk.ac.th', '38611@bpk.ac.th', '2024-08-06 10:03:46'),
(16, 'สรวิชญ์', 'สุขเอี่ยม', '38612', '2', '13', '38612@bpk.ac.th', '38612@bpk.ac.th', '38612@bpk.ac.th', '2024-08-06 10:03:46'),
(17, 'สิรพัธน์', 'จันมาลา', '38613', '2', '13', '38613@bpk.ac.th', '38613@bpk.ac.th', '38613@bpk.ac.th', '2024-08-06 10:03:46'),
(18, 'อติพัชร์', 'ศรีภักดี', '38614', '2', '13', '38614@bpk.ac.th', '38614@bpk.ac.th', '38614@bpk.ac.th', '2024-08-06 10:03:46'),
(19, 'วิริทธิ์พล', 'เจริญสิทธิกร', '38617', '2', '13', '38617@bpk.ac.th', '38617@bpk.ac.th', '38617@bpk.ac.th', '2024-08-06 10:03:46'),
(20, 'ปลิภา  ', 'ลมลอย', '38548', '2', '13', '38548@bpk.ac.th', '38548@bpk.ac.th', '38548@bpk.ac.th', '2024-08-06 10:03:46'),
(21, 'ญาดา', 'ศรีโสภณ', '38607', '2', '13', '38607@bpk.ac.th', '38607@bpk.ac.th', '38607@bpk.ac.th', '2024-08-06 10:03:46'),
(22, 'ชณัญธิดา', 'ปักเคทัง', '38615', '2', '13', '38615@bpk.ac.th', '38615@bpk.ac.th', '38615@bpk.ac.th', '2024-08-06 10:03:46'),
(23, 'ณรินทร์ทิพย์', 'จินดาเพ็ง', '38616', '2', '13', '38616@bpk.ac.th', '38616@bpk.ac.th', '38616@bpk.ac.th', '2024-08-06 10:03:46'),
(24, 'ณัฐติกานต์', 'รัตนประสิทธิ์', '38618', '2', '13', '38618@bpk.ac.th', '38618@bpk.ac.th', '38618@bpk.ac.th', '2024-08-06 10:03:46'),
(25, 'ณิชารีย์', 'ฉัตรไพศาลศิลป์', '38619', '2', '13', '38619@bpk.ac.th', '38619@bpk.ac.th', '38619@bpk.ac.th', '2024-08-06 10:03:46'),
(26, 'ธวัลรัตน์', 'พงษ์กิติวณิชกุล', '38620', '2', '13', '38620@bpk.ac.th', '38620@bpk.ac.th', '38620@bpk.ac.th', '2024-08-06 10:03:46'),
(27, 'นิยา', 'สัตตะชัยบุตร', '38621', '2', '13', '38621@bpk.ac.th', '38621@bpk.ac.th', '38621@bpk.ac.th', '2024-08-06 10:03:46'),
(28, 'ปพัชชนก', 'โภคาประกรณ์', '38622', '2', '13', '38622@bpk.ac.th', '38622@bpk.ac.th', '38622@bpk.ac.th', '2024-08-06 10:03:46'),
(29, 'ปวริศา', 'เจียรสุนันท์', '38623', '2', '13', '38623@bpk.ac.th', '38623@bpk.ac.th', '38623@bpk.ac.th', '2024-08-06 10:03:46'),
(30, 'ปวริศา', 'พุกเจริญ', '38624', '2', '13', '38624@bpk.ac.th', '38624@bpk.ac.th', '38624@bpk.ac.th', '2024-08-06 10:03:46'),
(31, 'ภรัณยา', 'จี้', '38625', '2', '13', '38625@bpk.ac.th', '38625@bpk.ac.th', '38625@bpk.ac.th', '2024-08-06 10:03:46'),
(32, 'ภิญญาพัชญ์', 'เหลืองธนพลกุล', '38626', '2', '13', '38626@bpk.ac.th', '38626@bpk.ac.th', '38626@bpk.ac.th', '2024-08-06 10:03:46'),
(33, 'มณฑน์ณิชชา', 'รันสันเทียะ', '38627', '2', '13', '38627@bpk.ac.th', '38627@bpk.ac.th', '38627@bpk.ac.th', '2024-08-06 10:03:46'),
(34, 'วชรพร', 'สักกามาตย์', '38628', '2', '13', '38628@bpk.ac.th', '38628@bpk.ac.th', '38628@bpk.ac.th', '2024-08-06 10:03:46'),
(35, 'ศุภสุตา', 'สุขเผือก', '38629', '2', '13', '38629@bpk.ac.th', '38629@bpk.ac.th', '38629@bpk.ac.th', '2024-08-06 10:03:46'),
(36, 'สิริรจน์', 'ศิริบุญรอด', '38630', '2', '13', '38630@bpk.ac.th', '38630@bpk.ac.th', '38630@bpk.ac.th', '2024-08-06 10:03:46'),
(37, 'กรัณย์พล', 'ศิริวงษ์ศิลป์', '38116', '3', '1', '38116@bpk.ac.th', '38116@bpk.ac.th', '38116@bpk.ac.th', '2024-08-06 10:03:46'),
(38, 'กิตติ', 'โกศลอาคมวิทยา', '38117', '3', '1', '38117@bpk.ac.th', '38117@bpk.ac.th', '38117@bpk.ac.th', '2024-08-06 10:03:46'),
(39, 'ชนะชัย', 'เฟื่องการงาน', '38119', '3', '1', '38119@bpk.ac.th', '38119@bpk.ac.th', '38119@bpk.ac.th', '2024-08-06 10:03:46'),
(40, 'ชารีฟ', 'แสงประสพ', '38120', '3', '1', '38120@bpk.ac.th', '38120@bpk.ac.th', '38120@bpk.ac.th', '2024-08-06 10:03:46'),
(41, 'ณัฐกมล', 'ด้วงหมุน', '38121', '3', '1', '38121@bpk.ac.th', '38121@bpk.ac.th', '38121@bpk.ac.th', '2024-08-06 10:03:46'),
(42, 'ธนภัทร', 'เผือกวัฒนะ', '38122', '3', '1', '38122@bpk.ac.th', '38122@bpk.ac.th', '38122@bpk.ac.th', '2024-08-06 10:03:46'),
(43, 'นนทกร', 'ชูนามชัย', '38123', '3', '1', '38123@bpk.ac.th', '38123@bpk.ac.th', '38123@bpk.ac.th', '2024-08-06 10:03:46'),
(44, 'นิมิต', 'สิริโพธิ์ไพศาล', '38125', '3', '1', '38125@bpk.ac.th', '38125@bpk.ac.th', '38125@bpk.ac.th', '2024-08-06 10:03:46'),
(45, 'ปกรณ์', 'ช้างชายวงศ์', '38126', '3', '1', '38126@bpk.ac.th', '38126@bpk.ac.th', '38126@bpk.ac.th', '2024-08-06 10:03:46'),
(46, 'พิรภพ', 'เพ็ชรนิล', '38127', '3', '1', '38127@bpk.ac.th', '38127@bpk.ac.th', '38127@bpk.ac.th', '2024-08-06 10:03:46'),
(47, 'วชิรวิชญ์', 'ประจิตร', '38128', '3', '1', '38128@bpk.ac.th', '38128@bpk.ac.th', '38128@bpk.ac.th', '2024-08-06 10:03:46'),
(48, 'วิศรุต', 'พืชผักหวาน', '38129', '3', '1', '38129@bpk.ac.th', '38129@bpk.ac.th', '38129@bpk.ac.th', '2024-08-06 10:03:46'),
(49, 'สุทิวัส', 'เถาว์ชู', '38130', '3', '1', '38130@bpk.ac.th', '38130@bpk.ac.th', '38130@bpk.ac.th', '2024-08-06 10:03:46'),
(50, 'อธิษฐาน', 'สวนจันทร์', '38131', '3', '1', '38131@bpk.ac.th', '38131@bpk.ac.th', '38131@bpk.ac.th', '2024-08-06 10:03:46'),
(51, 'อมรรัตนะ', 'ปัญญาใส', '38132', '3', '1', '38132@bpk.ac.th', '38132@bpk.ac.th', '38132@bpk.ac.th', '2024-08-06 10:03:46'),
(52, 'วงศ์พัทธ์', 'ชูก้าน', '38140', '3', '1', '38140@bpk.ac.th', '38140@bpk.ac.th', '38140@bpk.ac.th', '2024-08-06 10:03:46'),
(53, 'บวรลักษณ์', 'พงษ์ประพันธ์', '38007', '3', '1', '38007@bpk.ac.th', '38007@bpk.ac.th', '38007@bpk.ac.th', '2024-08-06 10:03:46'),
(54, 'ศิวารัตน์', 'ยะซัน', '38118', '3', '1', '38118@bpk.ac.th', '38118@bpk.ac.th', '38118@bpk.ac.th', '2024-08-06 10:03:46'),
(55, 'ยชญา', 'ครยก', '38124', '3', '1', '38124@bpk.ac.th', '38124@bpk.ac.th', '38124@bpk.ac.th', '2024-08-06 10:03:46'),
(56, 'ภคพร', 'เอี่ยมสนธิทรัพย์', '38133', '3', '1', '38133@bpk.ac.th', '38133@bpk.ac.th', '38133@bpk.ac.th', '2024-08-06 10:03:46'),
(57, 'จรรยวรรธน์', 'ธนศิริวรกุล', '38134', '3', '1', '38134@bpk.ac.th', '38134@bpk.ac.th', '38134@bpk.ac.th', '2024-08-06 10:03:46'),
(58, 'จุฑาทิพ', 'จิระพัฒนา', '38135', '3', '1', '38135@bpk.ac.th', '38135@bpk.ac.th', '38135@bpk.ac.th', '2024-08-06 10:03:46'),
(59, 'ชัชญาภา', 'อรรคนันต์', '38136', '3', '1', '38136@bpk.ac.th', '38136@bpk.ac.th', '38136@bpk.ac.th', '2024-08-06 10:03:46'),
(60, 'ณัฏฐณิชา', 'บุญญามิ่ง', '38137', '3', '1', '38137@bpk.ac.th', '38137@bpk.ac.th', '38137@bpk.ac.th', '2024-08-06 10:03:46'),
(61, 'ณัฐณิชา', 'ขุนจันทร์', '38138', '3', '1', '38138@bpk.ac.th', '38138@bpk.ac.th', '38138@bpk.ac.th', '2024-08-06 10:03:46'),
(62, 'ณัฐณิชา', 'พันธมา', '38139', '3', '1', '38139@bpk.ac.th', '38139@bpk.ac.th', '38139@bpk.ac.th', '2024-08-06 10:03:46'),
(63, 'ธนิษฐา', 'ศรีกฤษณ์', '38141', '3', '1', '38141@bpk.ac.th', '38141@bpk.ac.th', '38141@bpk.ac.th', '2024-08-06 10:03:46'),
(64, 'บัณฑิตา', 'หีบแก้ว', '38142', '3', '1', '38142@bpk.ac.th', '38142@bpk.ac.th', '38142@bpk.ac.th', '2024-08-06 10:03:46'),
(65, 'พรนิภา', 'สุทธิประภา', '38143', '3', '1', '38143@bpk.ac.th', '38143@bpk.ac.th', '38143@bpk.ac.th', '2024-08-06 10:03:46'),
(66, 'พิชญ์สินี', 'บุญเตี้ย', '38144', '3', '1', '38144@bpk.ac.th', '38144@bpk.ac.th', '38144@bpk.ac.th', '2024-08-06 10:03:46'),
(67, 'ภคภร', 'อารีย์', '38145', '3', '1', '38145@bpk.ac.th', '38145@bpk.ac.th', '38145@bpk.ac.th', '2024-08-06 10:03:46'),
(68, 'ภูสนิสา', 'หุ่นศิลป์', '38146', '3', '1', '38146@bpk.ac.th', '38146@bpk.ac.th', '38146@bpk.ac.th', '2024-08-06 10:03:46'),
(69, 'รชยา', 'เอี่ยมสะอาด', '38147', '3', '1', '38147@bpk.ac.th', '38147@bpk.ac.th', '38147@bpk.ac.th', '2024-08-06 10:03:46'),
(70, 'รันชิดา', 'ตุลยาทร', '38148', '3', '1', '38148@bpk.ac.th', '38148@bpk.ac.th', '38148@bpk.ac.th', '2024-08-06 10:03:46'),
(71, 'วนิดา', 'ผาดี', '38149', '3', '1', '38149@bpk.ac.th', '38149@bpk.ac.th', '38149@bpk.ac.th', '2024-08-06 10:03:46'),
(72, 'ณัชชาพัชร์ ', 'นิธิกิจธนัทหิรัญ ', '38151', '3', '1', '38151@bpk.ac.th', '38151@bpk.ac.th', '38151@bpk.ac.th', '2024-08-06 10:03:46'),
(73, 'สุชานาฎ​', 'สุร​ทศพร​', '38152', '3', '1', '38152@bpk.ac.th', '38152@bpk.ac.th', '38152@bpk.ac.th', '2024-08-06 10:03:46'),
(74, 'สุพิชญา', 'คุณะสันธิ์', '38153', '3', '1', '38153@bpk.ac.th', '38153@bpk.ac.th', '38153@bpk.ac.th', '2024-08-06 10:03:46'),
(75, 'อนัญญา', 'ฉลอยฉิ่ม', '38154', '3', '1', '38154@bpk.ac.th', '38154@bpk.ac.th', '38154@bpk.ac.th', '2024-08-06 10:03:46'),
(76, 'อริสา', 'ขันทอง', '38155', '3', '1', '38155@bpk.ac.th', '38155@bpk.ac.th', '38155@bpk.ac.th', '2024-08-06 10:03:46');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`ID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
